Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/losing_your_home/housing_options_for_homeless_people.html.txt.tmx
Source language: en
Languages: ga

source: There may be flexibility in cases where landlords seek rents that are above the Rent Supplement limits. This applies to existing tenants and to new Rent Supplement applicants
ga: Cuireann Threshold Seirbhís Cosanta Tionóntachta ar fáil le haghaidh daoine a bhfuil Forlíonadh Cíosa á fháil acu ach atá i mbaol a mbaile a chailleadh

source: The circumstances of tenants are considered on a case-by-case basis and rents increased above the set limits as appropriate
ga: I mBaile Átha Cliath amháin a bhi an tseirbhís seo ar dtús, ach leathnaíodh í ansin go cathair Chorcaigh

source: Contact the local office that administers your Rent Supplement
ga: Léigh a thuilleadh mar gheall ar an tseirbhís seo

source: In addition, the Department of Social Protection, in conjunction with Threshold, operates a special protocol in areas where supply issues are particularly acute
ga: Muna bhfuil tú i mBaile Átha Cliath ná i gCorcaigh, déan teangmháil leis an oifig a riarann d'Fhorlíonadh Cíosa, chomh tapaidh agus is féidir leat

source: Other payments under the Supplementary Welfare Allowance scheme
ga: Íocaíochtaí eile faoin scéim um Liúntas Leasa Forlíontach

source: As well as Rent Supplement, the Supplementary Welfare Allowance scheme also includes a basic weekly payment and some discretionary payments
ga: Anuas ar an bhForlíonadh Cíosa, áirítear leis an scéim um Liúntas Leasa Forlíontach íocaíocht bhunúsach sheachtainiúil agus roinnt íocaíochtaí lánroghnacha

source: You may qualify for the weekly payment if you are not entitled to any other social welfare payment or if you are waiting for your claim for any other payment to be processed
ga: Féadfaidh tú cáiliú le haghaidh na híocaíochta seachtainiúla mura bhfuil tú i dteideal aon íocaíochta leasa shóisialaigh eile nó má tá tú ag fanacht go dtí go bpróiseáiltear d’éileamh ar aon íocaíocht eile

source: You may qualify for a discretionary payment if you are in need
ga: Féadfaidh tú cáiliú le haghaidh íocaíocht lánroghnach má tá tú i ngátar

source: The one most immediately relevant for homeless people is an Exceptional Needs Payment
ga: An ceann atá is ábhartha ar dtús do dhaoine gan dídean is ea Íocaíocht Riachtanas Eisceachtúil

source: This is a one-off payment that you may get if you have unforeseen expenses such as clothing, travel, rent deposit or costs relating to setting up a home that you could not reasonably be expected to meet from your weekly income
ga: Is é atá i gceist ann ná íocaíocht aonuaire a fhéadfaidh tú a fháil más rud é go bhfuil speansais nach rabhthas ag súil leo agat amhail éadach, taisteal, éarlais chíosa nó costais a bhaineann le teach a shocrú nach bhféadfaí a bheith ag súil le réasún go n-íocfá ó d’ioncam seachtainiúil

source: See our document on agencies providing services for homeless people for details of where to apply for the various supports outlined above
ga: Féach inár gcáipéis Gníomhaireachtaí a sholáthraíonn seirbhísí do dhaoine gan dídean chun a fháil amach cén áit a ndéanfar iarratas ar na tacaíochtaí thuas
